import xlrd
import os
if __name__ == "__main__":
    MyclassName = {
        '2106200202': '李佳泉',
        '2106200204': '曾勇辉',
        '2106200205': '吴玉萍',
        '2106200206': '叶俊威',
        '2106200207': '陈美静',
        '2106200208': '罗依轻',
        '2106200209': '林育生',
        '2106200210': '唐远韩',
        '2106200213': '胡梦芹',
        '2106200214': '郑腾跃',
        '2106200215': '庄佳胜',
        '2106200216': '李灿植',
        '2106200217': '卢佳鑫',
        '2106200218': '林炼培',
        '2106200219': '孙湃钒',
        '2106200222': '卢敏如',
        '2106200223': '阮宇航',
        '2106200224': '黄嘉怡',
        '2106200225': '李金海',
        '2106200226': '蔡梓沛',
        '2106200227': '张楷',
        '2106200228': '周泽伟',
        '2106200229': '沈浩英',
        '2106200230': '林楷帆',
        '2106200231': '郭卓佳',
        '2106200232': '林曼如',
        '2106200233': '张霖',
        '2106200235': '林小荣',
        '2106200236': '方洪宇',
        '2106200237': '郑凯立',
        '2106200238': '钟广源',
        '2106200239': '邓林彬',
        '2106200240': '刘纯娜',
        '2106200241': '方润中',
        '2106200242': '杜承臻',
        '2106200243': '肖雅欣',
        '2106200244': '谭子诚',
        '2106200245': '李铧斌',
        '2106200246': '李健宏',
        '2106200247': '陈燊燊',
        '2106200248': '李硕',
        '2106200249': '罗丽君',
        '2106200250': '方恒嘉',
        '2106200251': '黄文轩',
        '2106200252': '彭俊豪',
        '2106200253': '林杰鹏',
    }
    for i in os.listdir():
        if '.xlsx' in i or '.xls' in i:
            data = xlrd.open_workbook(i)
            table = data.sheets()[0]
            row = table.row(2)
            x = 0
            print(row)
            for i, j in enumerate(row):
                if '学号' in str(j.value):
                    x = i
                    nrows = table.nrows
                    XH=list(i.value[-2:] for i in table.col(x,start_rowx=5))
                    num=0
                    for i in MyclassName:
                        if i[-2:] not in XH:
                            num+=1
                            print(MyclassName[i],i,sep='\t')
                    if num==0:
                        print('学完了')
                    else:
                        print(f'共{num}人')
                    break