USE [master]
GO
/****** Object:  Database [管理员]    Script Date: 2023/4/2 22:31:18 ******/
CREATE DATABASE [管理员]
 CONTAINMENT = NONE
 ON  PRIMARY 
( NAME = N'管理员', FILENAME = N'D:\Program Files\Microsoft SQL Server\MSSQL15.MSSQLSERVER\MSSQL\DATA\管理员.mdf' , SIZE = 8192KB , MAXSIZE = UNLIMITED, FILEGROWTH = 65536KB )
 LOG ON 
( NAME = N'管理员_log', FILENAME = N'D:\Program Files\Microsoft SQL Server\MSSQL15.MSSQLSERVER\MSSQL\DATA\管理员_log.ldf' , SIZE = 8192KB , MAXSIZE = 2048GB , FILEGROWTH = 65536KB )
 WITH CATALOG_COLLATION = DATABASE_DEFAULT
GO
ALTER DATABASE [管理员] SET COMPATIBILITY_LEVEL = 150
GO
IF (1 = FULLTEXTSERVICEPROPERTY('IsFullTextInstalled'))
begin
EXEC [管理员].[dbo].[sp_fulltext_database] @action = 'enable'
end
GO
ALTER DATABASE [管理员] SET ANSI_NULL_DEFAULT OFF 
GO
ALTER DATABASE [管理员] SET ANSI_NULLS OFF 
GO
ALTER DATABASE [管理员] SET ANSI_PADDING OFF 
GO
ALTER DATABASE [管理员] SET ANSI_WARNINGS OFF 
GO
ALTER DATABASE [管理员] SET ARITHABORT OFF 
GO
ALTER DATABASE [管理员] SET AUTO_CLOSE OFF 
GO
ALTER DATABASE [管理员] SET AUTO_SHRINK OFF 
GO
ALTER DATABASE [管理员] SET AUTO_UPDATE_STATISTICS ON 
GO
ALTER DATABASE [管理员] SET CURSOR_CLOSE_ON_COMMIT OFF 
GO
ALTER DATABASE [管理员] SET CURSOR_DEFAULT  GLOBAL 
GO
ALTER DATABASE [管理员] SET CONCAT_NULL_YIELDS_NULL OFF 
GO
ALTER DATABASE [管理员] SET NUMERIC_ROUNDABORT OFF 
GO
ALTER DATABASE [管理员] SET QUOTED_IDENTIFIER OFF 
GO
ALTER DATABASE [管理员] SET RECURSIVE_TRIGGERS OFF 
GO
ALTER DATABASE [管理员] SET  DISABLE_BROKER 
GO
ALTER DATABASE [管理员] SET AUTO_UPDATE_STATISTICS_ASYNC OFF 
GO
ALTER DATABASE [管理员] SET DATE_CORRELATION_OPTIMIZATION OFF 
GO
ALTER DATABASE [管理员] SET TRUSTWORTHY OFF 
GO
ALTER DATABASE [管理员] SET ALLOW_SNAPSHOT_ISOLATION OFF 
GO
ALTER DATABASE [管理员] SET PARAMETERIZATION SIMPLE 
GO
ALTER DATABASE [管理员] SET READ_COMMITTED_SNAPSHOT OFF 
GO
ALTER DATABASE [管理员] SET HONOR_BROKER_PRIORITY OFF 
GO
ALTER DATABASE [管理员] SET RECOVERY FULL 
GO
ALTER DATABASE [管理员] SET  MULTI_USER 
GO
ALTER DATABASE [管理员] SET PAGE_VERIFY CHECKSUM  
GO
ALTER DATABASE [管理员] SET DB_CHAINING OFF 
GO
ALTER DATABASE [管理员] SET FILESTREAM( NON_TRANSACTED_ACCESS = OFF ) 
GO
ALTER DATABASE [管理员] SET TARGET_RECOVERY_TIME = 60 SECONDS 
GO
ALTER DATABASE [管理员] SET DELAYED_DURABILITY = DISABLED 
GO
EXEC sys.sp_db_vardecimal_storage_format N'管理员', N'ON'
GO
ALTER DATABASE [管理员] SET QUERY_STORE = OFF
GO
USE [管理员]
GO
/****** Object:  Table [dbo].[管理员]    Script Date: 2023/4/2 22:31:18 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[管理员](
	[学生姓名] [varchar](10) NULL,
	[性别] [varchar](3) NULL,
	[学号] [int] NULL,
	[账号] [int] NULL,
	[密码] [int] NULL,
	[年级] [varchar](15) NULL,
	[科目] [varchar](15) NULL
) ON [PRIMARY]
GO
INSERT [dbo].[管理员] ([学生姓名], [性别], [学号], [账号], [密码], [年级], [科目]) VALUES (N'张吉惟', N'男', 22062200, 22085661, 12345678, N'大一', N'高等数学'),
(N'林国瑞', N'女', 22062201, 22085662, 12345679, N'大一', N'高等数学'),
(N'林玟书', N'女', 22062202, 22085663, 12345680, N'大一', N'高等数学'),
(N'林雅南', N'女', 22062203, 22085664, 12345681, N'大一', N'高等数学'),
(N'江奕云', N'男', 22062204, 22085665, 12345682, N'大一', N'高等数学'),
(N'刘柏宏', N'女', 22062205, 22085666, 12345683, N'大一', N'高等数学'),
(N'阮建安', N'男', 22062206, 22085667, 12345684, N'大一', N'高等数学'),
(N'林子帆', N'男', 22062207, 22085668, 12345685, N'大一', N'高等数学'),
(N'夏志豪', N'女', 22062208, 22085669, 12345686, N'大一', N'高等数学'),
(N'吉茹定', N'男', 22062209, 22085670, 12345687, N'大一', N'高等数学'),
(N'李中冰', N'女', 22062210, 22085671, 12345688, N'大一', N'高等数学'),
(N'黄文隆', N'女', 22062211, 22085672, 12345689, N'大一', N'高等数学'),
(N'谢彦文', N'女', 22062212, 22085673, 12345690, N'大一', N'高等数学'),
(N'傅智翔', N'男', 22062213, 22085674, 12345691, N'大一', N'高等数学'),
(N'洪振霞', N'女', 22062214, 22085675, 12345692, N'大一', N'高等数学'),
(N'刘姿婷', N'男', 22062215, 22085676, 12345693, N'大一', N'高等数学'),
(N'荣姿康', N'男', 22062216, 22085677, 12345694, N'大一', N'高等数学'),
(N'吕致盈', N'女', 22062217, 22085678, 12345695, N'大一', N'高等数学'),
(N'方一强', N'女', 22062218, 22085679, 12345696, N'大一', N'高等数学'),
(N'黎芸贵', N'男', 22062219, 22085680, 12345697, N'大一', N'高等数学'),
(N'郑伊雯', N'男', 22062220, 22085681, 12345698, N'大一', N'高等数学'),
(N'雷进宝', N'女', 22062221, 22085682, 12345699, N'大一', N'高等数学'),
(N'吴美隆', N'男', 22062222, 22085683, 12345700, N'大一', N'高等数学'),
(N'吴心真', N'女', 22062223, 22085684, 12345701, N'大一', N'高等数学'),
(N'王美珠', N'女', 22062224, 22085685, 12345702, N'大一', N'高等数学'),
(N'郭芳天', N'女', 22062225, 22085686, 12345703, N'大一', N'高等数学'),
(N'李雅惠', N'男', 22062226, 22085687, 12345704, N'大一', N'高等数学'),
(N'陈文婷', N'女', 22062227, 22085688, 12345705, N'大一', N'高等数学'),
(N'曹敏侑', N'男', 22062228, 22085689, 12345706, N'大一', N'高等数学'),
(N'王依婷', N'女', 22062229, 22085690, 12345707, N'大一', N'高等数学'),
(N'陈婉璇', N'女', 22062230, 22085691, 12345708, N'大一', N'高等数学'),
(N'吴美玉', N'女', 22062231, 22085692, 12345709, N'大一', N'高等数学'),
(N'蔡依婷', N'男', 22062232, 22085693, 12345710, N'大一', N'高等数学'),
(N'郑昌梦', N'男', 22062233, 22085694, 12345711, N'大一', N'高等数学'),
(N'林家纶', N'女', 22062234, 22085695, 12345712, N'大一', N'高等数学'),
(N'黄丽昆', N'女', 22062235, 22085696, 12345713, N'大一', N'高等数学'),
(N'黄芸欢', N'女', 22062236, 22085697, 12345714, N'大一', N'高等数学'),
(N'吴韵如', N'男', 22062237, 22085698, 12345715, N'大一', N'高等数学'),
(N'李肇芬', N'女', 22062238, 22085699, 12345716, N'大一', N'高等数学'),
(N'卢木仲', N'男', 22062239, 22085700, 12345717, N'大一', N'高等数学'),
(N'李成白', N'女', 22062240, 22085701, 12345718, N'大一', N'高等数学'),
(N'方兆玉', N'女', 22062241, 22085702, 12345719, N'大一', N'高等数学'),
(N'刘翊惠', N'女', 22062242, 22085703, 12345720, N'大一', N'高等数学'),
(N'丁汉臻', N'男', 22062243, 22085704, 12345721, N'大一', N'高等数学'),
(N'吴佳瑞', N'男', 22062244, 22085705, 12345722, N'大一', N'高等数学'),
(N'舒绿珮', N'女', 22062245, 22085706, 12345723, N'大一', N'高等数学'),
(N'周白芷', N'男', 22062246, 22085707, 12345724, N'大一', N'高等数学'),
(N'张姿妤', N'女', 22062247, 22085708, 12345725, N'大一', N'高等数学'),
(N'张虹伦', N'女', 22062248, 22085709, 12345726, N'大一', N'高等数学'),
(N'周琼玟', N'女', 22062249, 22085710, 12345727, N'大一', N'高等数学'),
(N'倪怡芳', N'男', 22062250, 22085711, 12345728, N'大一', N'高等数学'),
(N'郭贵妃', N'女', 22062251, 22085712, 12345729, N'大一', N'高等数学'),
(N'杨佩芳', N'女', 22062252, 22085713, 12345730, N'大一', N'高等数学'),
(N'黄文旺', N'女', 22062253, 22085714, 12345731, N'大一', N'高等数学'),
(N'黄盛玫', N'男', 22062254, 22085715, 12345732, N'大一', N'高等数学'),
(N'郑丽青', N'男', 22062255, 22085716, 12345733, N'大一', N'高等数学'),
(N'许智云', N'女', 22062256, 22085717, 12345734, N'大一', N'高等数学'),
(N'张孟涵', N'男', 22062257, 22085718, 12345735, N'大一', N'高等数学'),
(N'李小爱', N'女', 22062258, 22085719, 12345736, N'大一', N'高等数学'),
(N'王恩龙', N'女', 22062259, 22085720, 12345737, N'大一', N'高等数学'),
(N'朱政廷', N'女', 22062260, 22085721, 12345738, N'大一', N'高等数学'),
(N'邓诗涵', N'男', 22062261, 22085722, 12345739, N'大一', N'高等数学'),
(N'陈政倩', N'女', 22062262, 22085723, 12345740, N'大一', N'高等数学'),
(N'吴俊伯', N'女', 22062263, 22085724, 12345741, N'大一', N'高等数学'),
(N'阮馨学', N'男', 22062264, 22085725, 12345742, N'大一', N'高等数学'),
(N'翁惠珠', N'男', 22062265, 22085726, 12345743, N'大一', N'高等数学'),
(N'吴思翰', N'女', 22062266, 22085727, 12345744, N'大一', N'高等数学'),
(N'林佩玲', N'男', 22062267, 22085728, 12345745, N'大一', N'高等数学'),
(N'邓海来', N'女', 22062268, 22085729, 12345746, N'大一', N'高等数学'),
(N'陈翊依', N'女', 22062269, 22085730, 12345747, N'大一', N'高等数学'),
(N'李建智', N'女', 22062270, 22085731, 12345748, N'大一', N'高等数学'),
(N'武淑芬', N'男', 22062271, 22085732, 12345749, N'大一', N'高等数学'),
(N'金雅琪', N'女', 22062272, 22085733, 12345750, N'大一', N'高等数学'),
(N'赖怡宜', N'女', 22062273, 22085734, 12345751, N'大一', N'高等数学'),
(N'孙宝元', N'女', 22062274, 22085735, 12345752, N'大一', N'高等数学'),
(N'章迎松', N'男', 22062275, 22085736, 12345753, N'大一', N'高等数学'),
(N'蒲寿昌', N'女', 22062276, 22085737, 12345754, N'大一', N'高等数学'),
(N'罗永昌', N'女', 22062277, 22085738, 12345755, N'大一', N'高等数学'),
(N'方曼寒', N'男', 22062278, 22085739, 12345756, N'大一', N'高等数学'),
(N'曹元徽', N'男', 22062279, 22085740, 12345757, N'大一', N'高等数学'),
(N'邵中', N'女', 22062280, 22085741, 12345758, N'大一', N'高等数学'),
(N'盛圣', N'男', 22062281, 22085742, 12345759, N'大一', N'高等数学'),
(N'谢幻', N'女', 22062282, 22085743, 12345760, N'大一', N'高等数学'),
(N'戎碧曼', N'女', 22062283, 22085744, 12345761, N'大一', N'高等数学'),
(N'竺寒珊', N'女', 22062284, 22085745, 12345762, N'大一', N'高等数学'),
(N'桓元瑶', N'男', 22062285, 22085746, 12345763, N'大一', N'高等数学'),
(N'裘天统', N'女', 22062286, 22085747, 12345764, N'大一', N'高等数学'),
(N'秦孤丹', N'男', 22062287, 22085748, 12345765, N'大一', N'高等数学'),
(N'白涵蕾', N'女', 22062288, 22085749, 12345766, N'大一', N'高等数学'),
(N'富乔', N'女', 22062289, 22085750, 12345767, N'大一', N'高等数学'),
(N'殳勉', N'男', 22062290, 22085751, 12345768, N'大一', N'高等数学'),
(N'韩盼翠', N'男', 22062291, 22085752, 12345769, N'大一', N'高等数学'),
(N'袁寒荷', N'女', 22062292, 22085753, 12345770, N'大一', N'高等数学'),
(N'窦晗', N'男', 22062293, 22085754, 12345771, N'大一', N'高等数学'),
(N'羊从蓉', N'女', 22062294, 22085755, 12345772, N'大一', N'高等数学'),
(N'龚裔', N'女', 22062295, 22085756, 12345773, N'大一', N'高等数学'),
(N'郝绮梅', N'女', 22062296, 22085757, 12345774, N'大一', N'高等数学'),
(N'戴兴和', N'男', 22062297, 22085758, 12345775, N'大一', N'高等数学'),
(N'阎水风', N'女', 22062298, 22085759, 12345776, N'大一', N'高等数学'),
(N'施天真', N'男', 22062299, 22085760, 12345777, N'大一', N'高等数学'),
(N'何兴平', N'男', 22062300, 22085761, 12345778, N'大一', N'高等数学'),
(N'王静槐', N'女', 22062301, 22085762, 12345779, N'大一', N'高等数学'),
(N'丁山菡', N'男', 22062302, 22085763, 12345780, N'大一', N'高等数学'),
(N'和冰烟', N'女', 22062303, 22085764, 12345781, N'大一', N'高等数学'),
(N'任蓁', N'女', 22062304, 22085765, 12345782, N'大一', N'高等数学'),
(N'萧梦之', N'女', 22062305, 22085766, 12345783, N'大一', N'高等数学'),
(N'黄笑', N'男', 22062306, 22085767, 12345784, N'大一', N'高等数学'),
(N'宿菁菁', N'女', 22062307, 22085768, 12345785, N'大一', N'高等数学'),
(N'叶映真', N'女', 22062308, 22085769, 12345786, N'大一', N'高等数学'),
(N'祁春梅', N'女', 22062309, 22085770, 12345787, N'大一', N'高等数学'),
(N'赵醉波', N'男', 22062310, 22085771, 12345788, N'大一', N'高等数学'),
(N'裘小龙', N'女', 22062311, 22085772, 12345789, N'大一', N'高等数学'),
(N'袁忆南', N'男', 22062312, 22085773, 12345790, N'大一', N'高等数学'),
(N'崔代玉', N'女', 22062313, 22085774, 12345791, N'大一', N'高等数学'),
(N'昌痴凝', N'女', 22062314, 22085775, 12345792, N'大一', N'高等数学'),
(N'高谷秋', N'男', 22062315, 22085776, 12345793, N'大一', N'高等数学'),
(N'宣觅风', N'男', 22062316, 22085777, 12345794, N'大一', N'高等数学'),
(N'水秋寒', N'女', 22062317, 22085778, 12345795, N'大一', N'高等数学'),
(N'黎智', N'男', 22062318, 22085779, 12345796, N'大一', N'高等数学'),
(N'何南风', N'女', 22062319, 22085780, 12345797, N'大一', N'高等数学'),
(N'朱冬易', N'女', 22062320, 22085781, 12345798, N'大一', N'高等数学'),
(N'戴碧凡', N'女', 22062321, 22085782, 12345799, N'大一', N'高等数学'),
(N'萧念波', N'男', 22062322, 22085783, 12345800, N'大一', N'高等数学'),
(N'孟人庆', N'女', 22062323, 22085784, 12345801, N'大一', N'高等数学'),
(N'吕从安', N'男', 22062324, 22085785, 12345802, N'大一', N'高等数学'),
(N'令狐春梅', N'男', 22062325, 22085786, 12345803, N'大一', N'高等数学'),
(N'周天春', N'女', 22062326, 22085787, 12345804, N'大一', N'高等数学'),
(N'赖永元', N'男', 22062327, 22085788, 12345805, N'大一', N'高等数学'),
(N'汪元徽', N'女', 22062328, 22085789, 12345806, N'大一', N'高等数学'),
(N'羿以柳', N'女', 22062329, 22085790, 12345807, N'大一', N'高等数学'),
(N'余甘露', N'女', 22062330, 22085791, 12345808, N'大一', N'高等数学'),
(N'柴凝蝶', N'男', 22062331, 22085792, 12345809, N'大一', N'高等数学'),
(N'池盼兰', N'男', 22062332, 22085793, 12345810, N'大一', N'高等数学'),
(N'文紫菱', N'女', 22062333, 22085794, 12345811, N'大一', N'高等数学'),
(N'刘锐', N'男', 22062334, 22085795, 12345812, N'大一', N'高等数学'),
(N'杨半雪', N'女', 22062335, 22085796, 12345813, N'大一', N'高等数学'),
(N'何光熙', N'女', 22062336, 22085797, 12345814, N'大一', N'高等数学'),
(N'程正始', N'女', 22062337, 22085798, 12345815, N'大一', N'高等数学'),
(N'阳南莲', N'男', 22062338, 22085799, 12345816, N'大一', N'高等数学'),
(N'冯微', N'女', 22062339, 22085800, 12345817, N'大一', N'高等数学'),
(N'益帆', N'男', 22062340, 22085801, 12345818, N'大一', N'高等数学'),
(N'叶寒烟', N'男', 22062341, 22085802, 12345819, N'大一', N'高等数学'),
(N'吴臭臭', N'女', 22062342, 22085803, 12345820, N'大一', N'高等数学'),
(N'闻醉薇', N'男', 22062343, 22085804, 12345821, N'大一', N'高等数学'),
(N'罗香菱', N'女', 22062344, 22085805, 12345822, N'大一', N'高等数学'),
(N'晁笑槐', N'女', 22062345, 22085806, 12345823, N'大一', N'高等数学'),
(N'胥天荷', N'女', 22062346, 22085807, 12345824, N'大一', N'高等数学'),
(N'王应天', N'男', 22062347, 22085808, 12345825, N'大一', N'高等数学'),
(N'刘鹏', N'男', 22062348, 22085809, 12345826, N'大一', N'高等数学'),
(N'夏翠安', N'女', 22062349, 22085810, 12345827, N'大一', N'高等数学'),
(N'诸半梦', N'男', 22062350, 22085811, 12345828, N'大一', N'高等数学'),
(N'冯涵双', N'男', 22062351, 22085812, 12345829, N'大一', N'高等数学'),
(N'纪痴香', N'女', 22062352, 22085813, 12345830, N'大一', N'高等数学'),
(N'邱天汉', N'男', 22062353, 22085814, 12345831, N'大一', N'高等数学'),
(N'桑乐萱', N'女', 22062354, 22085815, 12345832, N'大一', N'高等数学'),
(N'史韦', N'女', 22062355, 22085816, 12345833, N'大一', N'高等数学'),
(N'邱小珍', N'女', 22062356, 22085817, 12345834, N'大一', N'高等数学'),
(N'焦承安', N'男', 22062357, 22085818, 12345835, N'大一', N'高等数学'),
(N'邴幻柏', N'男', 22062358, 22085819, 12345836, N'大一', N'高等数学'),
(N'姜傲松', N'女', 22062359, 22085820, 12345837, N'大一', N'高等数学'),
(N'邹涛涛', N'男', 22062360, 22085821, 12345838, N'大一', N'高等数学'),
(N'万俟映梦', N'女', 22062361, 22085822, 12345839, N'大一', N'高等数学'),
(N'林怜菡', N'女', 22062362, 22085823, 12345840, N'大一', N'高等数学'),
(N'长孙寒凡', N'女', 22062363, 22085824, 12345841, N'大一', N'高等数学'),
(N'利翠容', N'男', 22062364, 22085825, 12345842, N'大一', N'高等数学'),
(N'胡丹萱', N'男', 22062365, 22085826, 12345843, N'大一', N'高等数学'),
(N'溥倩', N'女', 22062366, 22085827, 12345844, N'大一', N'高等数学'),
(N'文石头', N'女', 22062367, 22085828, 12345845, N'大一', N'高等数学'),
(N'阎雪旋', N'女', 22062368, 22085829, 12345846, N'大一', N'高等数学'),
(N'谢妙梦', N'男', 22062369, 22085830, 12345847, N'大一', N'高等数学'),
(N'丁安南', N'男', 22062370, 22085831, 12345848, N'大一', N'高等数学'),
(N'罗映菱', N'男', 22062371, 22085832, 12345849, N'大一', N'高等数学'),
(N'苗易蓉', N'女', 22062372, 22085833, 12345850, N'大一', N'高等数学'),
(N'乐子', N'女', 22062373, 22085834, 12345851, N'大一', N'高等数学'),
(N'宋含芙', N'女', 22062374, 22085835, 12345852, N'大一', N'高等数学'),
(N'马棒棒', N'男', 22062375, 22085836, 12345853, N'大一', N'高等数学'),
(N'朱芬', N'男', 22062376, 22085837, 12345854, N'大一', N'高等数学'),
(N'倪元凤', N'男', 22062377, 22085838, 12345855, N'大一', N'高等数学'),
(N'姚敏', N'男', 22062378, 22085839, 12345856, N'大一', N'高等数学'),
(N'常访梦', N'女', 22062379, 22085840, 12345857, N'大一', N'高等数学'),
(N'赖元兴', N'男', 22062380, 22085841, 12345858, N'大一', N'高等数学'),
(N'龙干明', N'女', 22062381, 22085842, 12345859, N'大一', N'高等数学'),
(N'朱安筠', N'女', 22062382, 22085843, 12345860, N'大一', N'高等数学'),
(N'赖问兰', N'女', 22062383, 22085844, 12345861, N'大一', N'高等数学'),
(N'姚盼山', N'男', 22062384, 22085845, 12345862, N'大一', N'高等数学'),
(N'朱如彤', N'男', 22062385, 22085846, 12345863, N'大一', N'高等数学'),
(N'黄宁', N'女', 22062386, 22085847, 12345864, N'大一', N'高等数学'),
(N'狄冷荷', N'女', 22062387, 22085848, 12345865, N'大一', N'高等数学'),
(N'糜幻', N'女', 22062388, 22085849, 12345866, N'大一', N'高等数学'),
(N'朱乐松', N'男', 22062389, 22085850, 12345867, N'大一', N'高等数学'),
(N'龚念文', N'女', 22062390, 22085851, 12345868, N'大一', N'高等数学'),
(N'师海之', N'女', 22062391, 22085852, 12345869, N'大一', N'高等数学'),
(N'熊含海', N'女', 22062392, 22085853, 12345870, N'大一', N'高等数学'),
(N'吕永平', N'男', 22062393, 22085854, 12345871, N'大一', N'高等数学'),
(N'任醉薇', N'男', 22062394, 22085855, 12345872, N'大一', N'高等数学'),
(N'严洋洋', N'女', 22062395, 22085856, 12345873, N'大一', N'高等数学'),
(N'卢绮菱', N'男', 22062396, 22085857, 12345874, N'大一', N'高等数学'),
(N'叶点点', N'女', 22062397, 22085858, 12345875, N'大一', N'高等数学'),
(N'谭潇', N'女', 22062398, 22085859, 12345876, N'大一', N'高等数学'),
(N'岳乐之', N'女', 22062399, 22085860, 12345877, N'大一', N'高等数学'),
(N'江永康', N'男', 22062400, 22085861, 12345878, N'大一', N'高等数学'),
(N'田妙旋', N'女', 22062401, 22085862, 12345879, N'大一', N'高等数学'),
(N'慕容凡巧', N'女', 22062402, 22085863, 12345880, N'大一', N'高等数学'),
(N'卢雪兰', N'女', 22062403, 22085864, 12345881, N'大一', N'高等数学'),
(N'代广', N'男', 22062404, 22085865, 12345882, N'大一', N'高等数学'),
(N'甄晓瑶', N'男', 22062405, 22085866, 12345883, N'大一', N'高等数学'),
(N'孟景', N'女', 22062406, 22085867, 12345884, N'大一', N'高等数学'),
(N'郭太元', N'女', 22062407, 22085868, 12345885, N'大一', N'高等数学'),
(N'唐清泰', N'男', 22062408, 22085869, 12345886, N'大一', N'高等数学'),
(N'龙鉴', N'女', 22062409, 22085870, 12345887, N'大一', N'高等数学'),
(N'关凡白', N'女', 22062410, 22085871, 12345888, N'大一', N'高等数学'),
(N'郭白容', N'女', 22062411, 22085872, 12345889, N'大一', N'高等数学')